app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["username", "test"], ["password", "1234"], ["email", "tester@test.com"], ["created_at", "2021-10-25 06:33:16.274195"], ["updated_at", "2021-10-25 06:33:16.274195"]]
---
  def subscribe
    Subscriber.create(user: current_user);