app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def require_user
    if params[:id].present?
      @user = User.find(params[:id])
    else
      @user = User.find(params[:user_id])